In [6]:
import pandas as pd

import pyodbc
server = 'orangemainsql.database.windows.net'
database = 'Main_SQL'
username = 'gauthier'
password = 'Supermotdepasse!42'
driver= '{ODBC Driver 17 for SQL Server}'

cnxn = pyodbc.connect('DRIVER='+driver+';SERVER='+server+';PORT=1433;DATABASE='+database+';UID='+username+';PWD='+ password)

## actors

In [26]:
query = "SELECT * FROM analysis_actors"
df_actors = pd.read_sql(query, cnxn)
df_actors.head()
# df_actors.describe()

     id   first_name  last_name gender  film_count
0   933        Lewis  Abernathy      M           1
1  2547       Andrew    Adamson      M           1
2  2700      William       Addy      M           1
3  2898     Seth (I)     Adkins      M           1
4  2925  Charles (I)      Adler      M           1

## directors

In [11]:
query = "SELECT * FROM analysis_directors"
df_directors = pd.read_sql(query, cnxn)
df_directors.head()

      id first_name  last_name
0    429     Andrew    Adamson
1   2931     Darren  Aronofsky
2   9247       Zach      Braff
3  11652  James (I)    Cameron
4  14927        Ron   Clements

## genres

In [12]:
query = "SELECT * FROM analysis_directors_genres"
df_directors_genres = pd.read_sql(query, cnxn)
df_directors_genres.head()

   director_id      genre  prob
0          429  Adventure  0.75
1          429      Music  0.25
2          429    Fantasy  0.75
3          429    Romance  0.50
4          429     Family  0.75

## movies

In [15]:
query = "SELECT * FROM analysis_movies"
df_movies = pd.read_sql(query, cnxn)
df_movies.head()

      id           name  year  rank
0  10920         Aliens  1986   8.2
1  17173   Animal House  1978   7.5
2  18979      Apollo 13  1995   7.5
3  30959  Batman Begins  2005   NaN
4  46169     Braveheart  1995   8.3

## movies_directors

In [16]:
query = "SELECT * FROM analysis_movies_directors"
df_movies_directors = pd.read_sql(query, cnxn)
df_movies_directors.head()

   director_id  movie_id
0          429    300229
1         2931    254943
2         9247    124110
3        11652     10920
4        11652    333856

## movies_genres

In [17]:
query = "SELECT * FROM analysis_movies_genres"
df_movies_genres = pd.read_sql(query, cnxn)
df_movies_genres.head()

   movie_id     genre
0     10920    Action
1     10920    Horror
2     10920    Sci-Fi
3     10920  Thriller
4     17173    Comedy

## roles

In [2]:
query = "SELECT * FROM analysis_roles"
df_roles = pd.read_sql(query, cnxn)
df_roles.head()

NameError: name 'pd' is not defined

## search 1

In [1]:
query = """
    SELECT * FROM (
        SELECT m.*, md.*, d.last_name, d.first_name
        FROM analysis_movies m 
        JOIN analysis_movies_directors md
        ON m.id = md.movie_id
        JOIN analysis_directors d ON CAST(d.id AS CHAR) = CAST (md.director_id AS CHAR)
    ) AS sub
    JOIN 
        analysis_movies_genres mg on sub.movie_id = mg.movie_id
    JOIN 
        analysis_roles r on r.movie_id = mg.movie_id
    JOIN 
        analysis_actors a on r.actor_id = a.id
    ORDER BY rank;"""

df_movies = pd.read_sql(query, cnxn)
df_movies.head()

NameError: name 'pd' is not defined